// Васильев Илья

package ilya_v.java.algorithms.lesson_5;

import java.util.Arrays;

public class Main {
    public static void main(String[] args) {

        // 1. Реализовать перевод из 10 в 2 систему счисления с использованием стека.

        Stack stack = new Stack();
        stack.push(1);
        stack.push(2);

        System.out.println(Arrays.toString(stack.field));
    }
        /*
        Домашняя работа урока номер 5 будет тут в течении новогодних праздников



        2. Добавить в программу “реализация стека на основе односвязного списка” проверку на выделение памяти.
            Если память не выделяется, то выводится соответствующее сообщение. Постарайтесь создать ситуацию, когда
            память не будет выделяться (добавлением большого количества данных).

        3. Написать программу, которая определяет, является ли введенная скобочная последовательность правильной.
            Примеры правильных скобочных выражений: (), ([])(), {}(), ([{}]),
             неправильных — )(, ())({), (, ])}), ([(]) для скобок [,(,{.

                Например: (2+(2*2)) или [2/{5*(4+7)}]
        */

    // 1. Реализовать перевод из 10 в 2 систему счисления с использованием стека.


}
